import React from 'react';

function Me() {
  return (
    <div className="me">
      <p>
        저의 개발의 시작은 스마트인재개발원에서 시작되었습니다. 그리고 어떤
        어려움에도 굴하지 않는다는 속담 "열 번 찍어 안 넘어가는 나무 없다" 가
        항상 저를 용기 있게 만들어줍니다.
      </p>
      <h5>성격의 장단점</h5>
      <p className="my-2">
        저에게 주어진 업무에 대해 끈기 있게 도전하는 것은 저의 강점 중
        하나입니다. 처음에는 낯선 설계 프로그램과 도면 속에서 어려움을 겪었지만,
        그 경험을 통해 자신감을 얻었습니다. 도면을 이해하고 프로그램을 활용하여
        원하는 결과물을 만들어내기 위해 반복적인 연습을 진행하며, 이를 통해
        자격증 취득에 성공했습니다.
      </p>
      <p className="my-2">
        저의 강점 중 하나는 뛰어난 집중력을 기반으로 계획된 일을 단시간에
        처리하는 능력입니다. 작업 효율을 높이기 위해 빠른 속도로 문제를 해결하는
        특징이 있습니다. 그러나 이는 예상치 못한 변수로 인해 계획에 일부 차질이
        생길 수 있다는 단점을 가지고 있습니다
      </p>
      <p className="my-2">
        이러한 단점을 보완하기 위해 저는 계획에 우선순위를 부여하고, 순서대로
        작업을 처리하는 습관을 길러왔습니다. 예상치 못한 상황에서도 능동적으로
        대응하기 위해 일의 우선순위를 명확히 하는 것이 중요하다고 생각하고
        있습니다. 이런 노력을 통해 언제나 적절하게 상황에 대응할 수 있도록
        노력하고 있습니다.
      </p>
      <p className="my-2">
        어려운 일에 도전하고, 끈기 있게 목표를 향해 나아가는 자세와 어떤
        상황에서도 유연하게 대처할 수 있는 능력은 프론트엔드 지원 업무에 기여할
        수 있는 요소라고 생각합니다. 이러한 성격적 강점을 바탕으로 업무를 수행할
        때, 항상 긍정적이고 적극적으로 팀에 기여할 수 있을 것입니다.
      </p>
      <h5>위기 극복</h5>
      <p className="my-2">
        웹 개발 프로젝트를 진행하던 중 주제 선정 과정에서 팀원 간의 의견 충돌이
        발생했습니다. 특정한 주제에 대하여 팀원들의 의견이 극명하게 대립하던
        상황이었습니다. 이 상황 속에서 잘못된 소통 방식으로 팀원들 간의 오해가
        쌓였고, 계속되는 갈등에 ‘프로젝트를 마무리할 수 있을까’ 하는 두려움이
        생겼습니다. 하지만 이러한 분위기 속에서는 프로젝트를 성공적으로 마무리할
        수 없었기에 팀원들 간의 화합을 위하여 노력해야겠다고 생각했습니다.
      </p>
      <p className="my-2">
        그래서, 의견 충돌이 있었던 팀원과 개별적으로 소통하며 갈등이 생긴 부분에
        대한 오해를 풀었고 전체 팀원들과 새롭게 업무를 분담했습니다. 다른
        팀들보다 주제 선정에 시간이 많이 소요되어 프로젝트를 마무리하는 데
        시간이 촉박했지만, 다 같이 협동하여 정해진 기한 안에 마무리할 수
        있었습니다.
      </p>
      <p className="my-2">
        이 경험을 통해 얻은 교훈은 다수의 사람들이 참여하는 프로젝트를 진행할
        때는 의견 충돌이 불가피하다는 것입니다. 이때 유연한 소통으로
        ‘집단지성’의 힘을 발휘하여 서로의 의견을 나누며 더 나은 방법을 찾아가는
        것이 중요하다는 것을 깨달았습니다. 또한, 시간적 제약 속에서도 팀원 간의
        협력과 조율을 통해 어려움을 극복하는 능력을 키울 수 있었습니다. 이러한
        경험을 통해 팀 프로젝트나 협업 시 어려운 상황에 유연하게 대처하고
        긍정적으로 문제를 해결하는 자세를 갖추게 되었습니다.
      </p>
      <div className="w-full text-center text-slate-800 text-sm mt-8">
        작성일: 2024년 01월 18일
      </div>
      <div className="w-full text-center text-slate-800 text-sm mt-8">
        작성자: 김민서
      </div>
    </div>
  );
}

export default Me;
