import React from 'react';

function Me() {
  return (
    <div className="me">
      <b className="my-2">
        첫째, 주어진 업무를 끈기 있게 수행하는 성향을 가지고 있습니다.
      </b>
      <p className="my-2">
        실제로 게임에서 이와 같은 끈기를 발휘한 경험이 있습니다. 특정 업적을
        달성하기 위해 전직 경로를 거치지 않고, 꾸준한 퀘스트와 사냥만으로 높은
        레벨을 달성하였습니다. 이 과정에서 저는 게임을 중도 포기하지 않고 꾸준히
        플레이하였고, 덕분에 게임 랭킹 5위 이내라는 성과를 이룰 수 있었습니다.
        랭킹을 유지하기 위해서 업데이트되는 퀘스트를 계속 수행해야 했으며, 이를
        위해 더욱 끈기 있게 노력했습니다.
      </p>
      <p className="my-2">
        게임으로 일궈진 끈기를 기반으로 React를 공부했고,컴포넌트를 재사용하기
        위해 분리하여 관리하는 등 JSON을 활용한 아이템 도감 사이트를 제작할 수
        있었습니다.
      </p>
      <p className="my-2">
        근성있는 태도는 코드의 오류를 찾아내어 사용자의 요구사항을 충족하는
        솔루션을 개발하는 데 필수적인 역량이라고 생각합니다. 게임에서 랭킹을
        유지하기 위해 꾸준히 노력한 것처럼, 개발 역량도 지속적으로
        향상시키기위해 새로운 기술 트렌드를 따라가며, 최적의 솔루션을 찾아내는
        데 집중하고 있습니다.
      </p>
      <b className="my-2">둘째, 망설이지 않고 도전합니다.</b>
      <p className="my-2">
        다양한 분야에 호기심이 많았던 저는 학창 시절 명확한 진로를 정하지
        못했습니다. 특히, 관심사가 발견될 때마다 깊게 탐구하는 데 힘썼으며, 이는
        다양한 자격증 취득으로 이어졌습니다. 새로운 도전은 제 지식과 경험을 넓혀
        주었으며 어떤 상황에서도 앞으로 나아가 성장하게 하는 원동력입니다. 또한
        처음 프로그래밍을 접했을 때, 낯선 용어와 복잡한 문법에 대한 이해는 쉬운
        일은 아니었습니다. 하지만 어려움을 피하기 보다는 용기를 냈고, 꾸준한
        복습으로 새로운 학습 내용을 익히는 데에 집중하였습니다.
      </p>
      <p className="my-2">
        그 결과, 자바스크립트를 기반으로 한 `지역별 날씨` 프로젝트에서 API를
        활용하는 등 관련 기능을 독자적으로 구현하는 능력을 키울 수 있었습니다.
        그동안 쌓아온 다양한 시도는 제 역량을 강화시키는 동시에, 새롭게 직면하는
        문제를 대처하는 데 필요한 유연성을 길러주었습니다. 앞으로 프론트엔드
        개발자로서 맡게 될 다양한 업무를 수행하는 데 있어서도 확실한 밑거름이 될
        것입니다.
      </p>

      <div className="w-full text-center text-slate-800 text-sm mt-8">
        작성일: 2024년 03월 03일
      </div>
      <div className="w-full text-center text-slate-800 text-sm mt-8">
        작성자: 김민서
      </div>
    </div>
  );
}

export default Me;
